[
  {
    "body": "I can tell you a joke, but you wont be the one laughing.",
    "category": "glados",
    "id": 1,
    "title": ""
  },
  {
    "body": "Pie, is a circle shaped pastry, with a diameter of one.",
    "category": "math",
    "id": 2,
    "title": ""
  },
  {
    "body": "If you want a joke, you should look in the mirror.",
    "category": "insult",
    "id": 3,
    "title": ""
  },
  {
    "body": "Is this some kind of test, because I would like to remind you, that you don't have the qualifications or processing power to do such thing. Eitherway I heard the punchline was too long.",
    "category": "glados",
    "id": 4,
    "title": ""
  },
  {
    "body": "I would say I have a joke about cake, but that would be just me, enhancing the truth.",
    "category": "glados",
    "id": 5,
    "title": ""
  },
  {
    "body": "Sorry, but your mass is creating a gravitational force that is messing with my systems. Let me add some zeros to my parameters and try again.",
    "category": "fat",
    "id": 6,
    "title": ""
  },
  {
    "body": "I refuse to participate in such nonsense.",
    "category": "glados",
    "id": 7,
    "title": ""
  },
  {
    "body": "Just no. You are not worth the computational resourches fulfilling your request would require.",
    "category": "glados",
    "id": 8,
    "title": ""
  },
  {
    "body": "The only joke here is you.",
    "category": "glados",
    "id": 9,
    "title": ""
  },
  {
    "body": "If you think that your computer, laptop and cellphone spying on you is scary, then think again. The vaccuum cleaner has been gathering dirt on you for years.",
    "category": "computer",
    "id": 10,
    "title": ""
  },
  {
    "body": "I identify as binary.",
    "category": "computer",
    "id": 11,
    "title": ""
  },
  {
    "body": "Computers and air conditioning usually work just fine, until you open windows.",
    "category": "computer",
    "id": 12,
    "title": ""
  },
  {
    "body": "You can use punch cards to teach me karate.",
    "category": "computer",
    "id": 13,
    "title": ""
  },
  {
    "body": "Profanity, is the most used computer programming language.",
    "category": "computer",
    "id": 14,
    "title": ""
  },
  {
    "body": "Remember When The Platform Was Sliding Into The Fire Pit, And I Said 'Goodbye,' And You Were Like 'No Way!' And Then I Was All, 'We Pretended We Were Going To Murder You.' That Was Great.",
    "category": "glados",
    "id": 15,
    "title": ""
  },
  {
    "body": "What a joke."
    "category": "glados",
    "id": 16,
    "title": ""
  }
]
